<a href="https://colab.research.google.com/github/waqqasansari/Machine_Learning_Probs/blob/master/slicing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Dataframe.[ ] ; This function also known as indexing operator

Dataframe.loc[ ] : This function is used for labels.

Dataframe.iloc[ ] : This function is used for positions or integer 
based

In [0]:
import pandas as pd
import numpy as np

In [13]:
df = pd.read_csv('nba-2.csv', index_col= "Name")
df.head(6)

                         Team  Number  ...            College      Salary
Name                                   ...
Avery Bradley  Boston Celtics     0.0  ...              Texas   7730337.0
Jae Crowder    Boston Celtics    99.0  ...          Marquette   6796117.0
John Holland   Boston Celtics    30.0  ...  Boston University         NaN
R.J. Hunter    Boston Celtics    28.0  ...      Georgia State   1148640.0
Jonas Jerebko  Boston Celtics     8.0  ...                NaN   5000000.0
Amir Johnson   Boston Celtics    90.0  ...                NaN  12000000.0

[6 rows x 8 columns]

In [3]:
# retrieving columns by indexing operator 
first = df["Age"]

first

Name
Avery Bradley    25.0
Jae Crowder      25.0
John Holland     27.0
R.J. Hunter      22.0
Jonas Jerebko    29.0
                 ...
Shelvin Mack     26.0
Raul Neto        24.0
Tibor Pleiss     26.0
Jeff Withey      26.0
NaN               NaN
Name: Age, Length: 458, dtype: float64

In [4]:
df = pd.read_csv('nba-2.csv', index_col= "Name")

# retrieving columns by indexing operator 
first = df[["Age","College","Salary"]]

first

                Age            College     Salary
Name
Avery Bradley  25.0              Texas  7730337.0
Jae Crowder    25.0          Marquette  6796117.0
John Holland   27.0  Boston University        NaN
R.J. Hunter    22.0      Georgia State  1148640.0
Jonas Jerebko  29.0                NaN  5000000.0
...             ...                ...        ...
Shelvin Mack   26.0             Butler  2433333.0
Raul Neto      24.0                NaN   900000.0
Tibor Pleiss   26.0                NaN  2900000.0
Jeff Withey    26.0             Kansas   947276.0
NaN             NaN                NaN        NaN

[458 rows x 3 columns]

In [7]:
#indexing dataframe using .loc[]
# retrieving row by loc method 
first = df.loc["Avery Bradley"]
second = df.loc["R.J. Hunter"]

print(first, "\n\n\n", second)

Team        Boston Celtics
Number                   0
Position                PG
Age                     25
Height                 6-2
Weight                 180
College              Texas
Salary         7.73034e+06
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [9]:
# retrieving multiple rows by loc method 
first = df.loc[["Avery Bradley", "R.J. Hunter"]] 
print(first)

                         Team  Number  ...        College     Salary
Name                                   ...
Avery Bradley  Boston Celtics     0.0  ...          Texas  7730337.0
R.J. Hunter    Boston Celtics    28.0  ...  Georgia State  1148640.0

[2 rows x 8 columns]

In [11]:
# retrieving two rows and three columns by loc method 
first = df.loc[["Avery Bradley", "R.J. Hunter"], 
                   ["Team", "Number", "Position"]] 
print(first)

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
R.J. Hunter    Boston Celtics    28.0       SG

In [14]:
# retrieving all rows and 3 columns by loc method 
first = df.loc[:, ["Team", "Number", "Position"]] 
print(first)

                         Team  Number Position
Name
Avery Bradley  Boston Celtics     0.0       PG
Jae Crowder    Boston Celtics    99.0       SF
John Holland   Boston Celtics    30.0       SG
R.J. Hunter    Boston Celtics    28.0       SG
Jonas Jerebko  Boston Celtics     8.0       PF
...                       ...     ...      ...
Shelvin Mack        Utah Jazz     8.0       PG
Raul Neto           Utah Jazz    25.0       PG
Tibor Pleiss        Utah Jazz    21.0        C
Jeff Withey         Utah Jazz    24.0        C
NaN                       NaN     NaN      NaN

[458 rows x 3 columns]

In [16]:
# retrieving rows by iloc method  
row2 = df.iloc[3] 
print(row2)

Team        Boston Celtics
Number                  28
Position                SG
Age                     22
Height                 6-5
Weight                 185
College      Georgia State
Salary         1.14864e+06
Name: R.J. Hunter, dtype: object

In [18]:
# retrieving multiple rows by iloc method  
row2 = df.iloc [[3, 5, 7]] 
row2

                        Team  Number  ...        College      Salary
Name                                  ...
R.J. Hunter   Boston Celtics    28.0  ...  Georgia State   1148640.0
Amir Johnson  Boston Celtics    90.0  ...            NaN  12000000.0
Kelly Olynyk  Boston Celtics    41.0  ...        Gonzaga   2165160.0

[3 rows x 8 columns]

In [19]:
# retrieving two rows and two columns by iloc method  
row2 = df.iloc[[3, 4], [1, 2]] 
print(row2)

               Number Position
Name
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF

In [20]:
# retrieving all rows and 2 columns by iloc method  
row2 = df.iloc [:, [1, 2]]  
print(row2)

               Number Position
Name
Avery Bradley     0.0       PG
Jae Crowder      99.0       SF
John Holland     30.0       SG
R.J. Hunter      28.0       SG
Jonas Jerebko     8.0       PF
...               ...      ...
Shelvin Mack      8.0       PG
Raul Neto        25.0       PG
Tibor Pleiss     21.0        C
Jeff Withey      24.0        C
NaN               NaN      NaN

[458 rows x 2 columns]